import random
print("Привет Мир, я магический шар, и я знаю ответ на любой ваш вопрос.")
print(" Как вас зовут?")
name=input()
print("Приятно познакомиться, "+ name+ "!")


replies = ['Бесспорно', 'Мне кажется - да', 'Пока неясно, попробуй снова',
        'Даже не думай', 'Предрешено', 'Вероятнее всего', 'Спроси позже',
        'Мой ответ - нет', 'Никаких сомнений', 'Хорошие перспективы',
        'Лучше не рассказывать', 'По моим данным - нет', 'Определённо да',
        'Знаки говорят - да', 'Сейчас нельзя предсказать',
        'Перспективы не очень хорошие', 'Можешь быть уверен в этом', 'Да',
        'Сконцентрируйся и спроси опять', 'Весьма сомнительно']

def game():
    print("Задайте свой вопрос!")
    question = input()
    answer = random.choice(replies)
    print(answer)

game()

while True:
    yes_no = input("Хотите задать еще один вопрос? (да/нет): ").strip().lower()
    if yes_no == "да":
        game()
    elif yes_no == "нет":
        print("Приходите снова!")
        break
    else:
        print("Пожалуйста, введите 'да' или 'нет'.")



